public class z1 {
    public static void main(String name[]) {
    if(name.length>0)
    {
    System.out.println("hello " + name[0]);
    }
    else
    {
    System.out.println("hello wrld");
    }
    }
    }
//Реализовать программу,получающую на вход в качестве аргумента имя человека и выводящую ”Hello ” + имя, в противном случае, если параметр не передавался, ”Hello world”.
